# Напишите функцию, которая будет принимать
# список чисел и положительное число top и
# возвращать сумму всех n-х чисел.
def sum_n_num(list, num):
    return sum(list[num-1::num])


print(sum_n_num([4, 8, 6, 6, 7, 9, 3], 1))
print(sum_n_num([7, 3, 10, 4, 5, 8, 4, 9, 6, 9, 10, 1, 4], 4))
print(sum_n_num([10, 6, 5, 4, 5, 2, 3, 3, 8, 10, 7, 2], 8))
print(sum_n_num([6, 8, 9, 4, 6, 4, 7, 1, 5, 6, 10, 2], 13))